RaisingAwesome/Rawpter4/rawpter4/boards.txt
rapwter4.name=Rawpter4 Flight Controller

# Upload settings
rapwter4.upload.tool=rfp_uploader
rapwter4.upload.protocol=serial
rapwter4.upload.speed=115200
rapwter4.upload.use_1200bps_touch=false
rapwter4.upload.wait_for_upload_port=true
rapwter4.upload.native_usb=false

# Build settings
rapwter4.build.mcu=cortex-m4
rapwter4.build.architecture=cortex-m4
rapwter4.build.f_cpu=48000000L
rapwter4.build.board=RA4M1_CUSTOM
rapwter4.build.core=arduino
rapwter4.build.variant=rawpter4_variant
rapwter4.build.extra_flags=
rapwter4.build.defines=-DF_CPU=48000000 -DNO_USB -DARDUINO_RAWPTER4
rapwter4.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

# Optional: FPU and float ABI (if needed)
rapwter4.build.fpu=-mfpu=fpv4-sp-d16
rapwter4.build.float-abi=-mfloat-abi=hard

# Bootloader (optional, for completeness)
rapwter4.bootloader.tool=rfp_uploader
rapwter4.bootloader.low_fuses=0xFF
rapwter4.bootloader.high_fuses=0xD8
rapwter4.bootloader.extended_fuses=0xFD